{
  "_name_or_path": "bert-base-uncased",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Allergy / Immunology",
    "1": "Cardiovascular / Pulmonary",
    "2": "Dermatology",
    "3": "Endocrinology",
    "4": "ENT - Otolaryngology",
    "5": "Gastroenterology",
    "6": "Hematology - Oncology",
    "7": "Nephrology",
    "8": "Neurology",
    "9": "Obstetrics / Gynecology",
    "10": "Ophthalmology",
    "11": "Radiology",
    "12": "Surgery",
    "13": "Urology",
    "14": "Orthopedics",
    "15": "Pediatrics",
    "16": "Psychiatry / Psychology"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Allergy / Immunology": 0,
    "Cardiovascular / Pulmonary": 1,
    "Dermatology": 2,
    "ENT - Otolaryngology": 4,
    "Endocrinology": 3,
    "Gastroenterology": 5,
    "Hematology - Oncology": 6,
    "Nephrology": 7,
    "Neurology": 8,
    "Obstetrics / Gynecology": 9,
    "Ophthalmology": 10,
    "Orthopedics": 14,
    "Pediatrics": 15,
    "Psychiatry / Psychology": 16,
    "Radiology": 11,
    "Surgery": 12,
    "Urology": 13
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.36.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
